#+TITLE: CMPUT201W20B2 Week 9
#+PROPERTY: header-args:C             :results output :exports no-export :flags -std=c99 -pedantic -Wall -Wextra -ftrapv -ggdb3 :eval yes :results value verbatim
#+PROPERTY: header-args:sh            :results output :exports no-export :eval yes :results value verbatim
#+PROPERTY: header-args:shell         :results output :exports no-export :eval yes :results value verbatim

*** Org export
#+BEGIN_SRC elisp
(org-html-export-to-html)
(org-latex-export-to-pdf)
(org-ascii-export-to-ascii)
#+END_SRC

#+RESULTS:
: ./presentation.txt


*** #ifdef

#+BEGIN_SRC C :exports both 
/* #ifdef   IF DEFined
 * 
 * If whatever comes after the #ifdef IS
 * defined, then all the code until the #endif
 * be treated normally.
 * 
 * If whatever comes afer the #ifdef is NOT
 * defined, then all the code until the #endif
 * will be SKIPPED, and not compiled at all.
 * 
 * #else    
 * Similar to else but in the preprocessor
 */

#include <stdio.h>
#include <stdio.h>

#ifdef ENABLE_NONSENSE
this is not even real c code!

all of this gets skipped
#endif

// Try commenting/uncommenting the following:
#define TURBO
#define DEBUG



int main() {
    
#ifdef TURBO
    int value = 27;
#else
    int value = 32;
#endif /* def TURBO */

    printf("Value is %d!\n", value);
    
#ifdef TURBO
    printf("Turbo is on!\n");
#endif /* def TURBO */
    
#ifdef DEBUG
    printf("Reached end of main, quitting!\n");
#endif
    
    return 0;
}
#+END_SRC

#+RESULTS:
: Value is 27!
: Turbo is on!
: Reached end of main, quitting!

*** #ifndef

#+BEGIN_SRC C :exports both
/* #ifndef   IF Not DEFined
 * 
 * If whatever comes after the #ifndef is NOT
 * defined, then all the code until the #endif
 * be treated normally.
 * 
 * If whatever comes afer the #ifndef IS
 * defined, then all the code until the #endif
 * will be SKIPPED, and not compiled at all.
 */

#include <stdio.h>

#ifdef THING
order matters here
#ifdef OTHER_THING
this will only appear in the compiled program if both things are defined

order doesnt matter here
#endif
order matters here too
#endif

#ifndef MAIN_DEFINED
#define MAIN_DEFINED
int main() {
    printf("Main 1!\n");
    return 0;
}
#endif

#ifndef MAIN_DEFINED
#define MAIN_DEFINED
int main() {
    printf("Main 2!\n");
    return 0;
}
#endif
#+END_SRC

#+RESULTS:
: Main 1!

